vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXC143_DFP.pdsc
    <condition id="anyOf.driver.lpuart.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart"/>
    </condition>
    <condition id="component.lpuart_dma_adapter.condition_id">
      <require condition="allOf.anyOf=driver.dma, component.lpuart_adapter, component.timer_manager, driver.lpuart, device=MCXC143.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.dma, component.lpuart_adapter, component.timer_manager, driver.lpuart, device=MCXC143.internal_condition">
      <require condition="anyOf.driver.dma.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="timer_manager"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart"/>
      <require condition="device.MCXC143.internal_condition"/>
    </condition>
    <condition id="anyOf.driver.dma.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="dma"/>
    </condition>
    <condition id="component.mem_manager.condition_id">
      <require condition="allOf.anyOf=component.mem_manager_legacy, component.mem_manager_light, component.lists, device=MCXC143.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=component.mem_manager_legacy, component.mem_manager_light, component.lists, device=MCXC143.internal_condition">
      <require condition="anyOf.component.mem_manager_legacy, component.mem_manager_light.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lists"/>
      <require condition="device.MCXC143.internal_condition"/>
    </condition>
    <condition id="anyOf.component.mem_manager_legacy, component.mem_manager_light.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="mem_manager_legacy"/>
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="mem_manager_light"/>
    </condition>
    <condition id="component.mem_manager_legacy.condition_id">
      <require condition="allOf.component.mem_manager, device=MCXC143.internal_condition"/>
    </condition>
    <condition id="allOf.component.mem_manager, device=MCXC143.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="mem_manager"/>
      <require condition="device.MCXC143.internal_condition"/>
    </condition>
    <condition id="component.mem_manager_light.condition_id">
      <require condition="allOf.component.mem_manager, device=MCXC143.internal_condition"/>
    </condition>
    <condition id="component.panic.condition_id">
      <require condition="allOf.device=MCXC143.internal_condition"/>
    </condition>
    <condition id="component.pcm186x_adapter.condition_id">
      <require condition="allOf.device=MCXC143.internal_condition"/>
    </condition>
    <condition id="component.pcm512x_adapter.condition_id">
      <require condition="allOf.device=MCXC143.internal_condition"/>
    </condition>
    <condition id="component.pit_adapter.condition_id">
      <require condition="allOf.driver.pit, device=MCXC143.internal_condition"/>
    </condition>
    <condition id="allOf.driver.pit, device=MCXC143.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="pit"/>
      <require condition="device.MCXC143.internal_condition"/>
    </condition>
    <condition id="component.pwm_tpm_adapter.condition_id">
      <require condition="allOf.driver.tpm, device=MCXC143.internal_condition"/>
    </condition>
    <condition id="allOf.driver.tpm, device=MCXC143.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="tpm"/>
      <require condition="device.MCXC143.internal_condition"/>
    </condition>
    <condition id="component.reset_adapter.condition_id">
      <require condition="allOf.device=MCXC143.internal_condition"/>
    </condition>
    <condition id="component.rng_adapter_interface.condition_id">
      <require condition="allOf.anyOf=component.software_rng_adapter, device=MCXC143.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=component.software_rng_adapter, device=MCXC143.internal_condition">
      <require condition="anyOf.component.software_rng_adapter.internal_condition"/>
      <require condition="device.MCXC143.internal_condition"/>
    </condition>
    <condition id="anyOf.component.software_rng_adapter.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="software_rng_adapter"/>
    </condition>
    <condition id="component.rnga_adapter.condition_id">
      <require condition="allOf.device=MCXC143.internal_condition"/>
    </condition>
    <condition id="component.rtc_adapter.condition_id">
      <require condition="allOf.driver.rtc, device=MCXC143.internal_condition"/>
    </condition>
    <condition id="allOf.driver.rtc, device=MCXC143.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="rtc"/>
      <require condition="device.MCXC143.internal_condition"/>
    </condition>
    <condition id="component.serial_manager.condition_id">
      <require condition="allOf.anyOf=component.serial_manager_spi, component.serial_manager_swo, component.serial_manager_uart, component.serial_manager_virtual, component.lists, driver.common, device=MCXC143.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=component.serial_manager_spi, component.serial_manager_swo, component.serial_manager_uart, component.serial_manager_virtual, component.lists, driver.common, device=MCXC143.internal_condition">
      <require condition="anyOf.component.serial_manager_spi, component.serial_manager_swo, component.serial_manager_uart, component.serial_manager_virtual.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lists"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="device.MCXC143.internal_condition"/>
    </condition>
    <condition id="anyOf.component.serial_manager_spi, component.serial_manager_swo, component.serial_manager_uart, component.serial_manager_virtual.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager_spi"/>
      <accept Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager_swo"/>
      <accept Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager_uart"/>
      <accept Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager_virtual"/>
    </condition>
    <condition id="component.serial_manager_spi.condition_id">
      <require condition="allOf.anyOf=allOf=component.spi_adapter, driver.spi, device=MCXC143.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=allOf=component.spi_adapter, driver.spi, device=MCXC143.internal_condition">
      <require condition="anyOf.allOf=component.spi_adapter, driver.spi.internal_condition"/>
      <require condition="device.MCXC143.internal_condition"/>
    </condition>
    <condition id="anyOf.allOf=component.spi_adapter, driver.spi.internal_condition">
      <accept condition="allOf.component.spi_adapter, driver.spi.internal_condition"/>
    </condition>
    <condition id="allOf.component.spi_adapter, driver.spi.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="spi_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="spi"/>
    </condition>
    <condition id="component.serial_manager_swo.condition_id">
      <require condition="allOf.device=MCXC143.internal_condition"/>
    </condition>
    <condition id="component.serial_manager_uart.condition_id">
      <require condition="allOf.component.lpuart_adapter, device=MCXC143.internal_condition"/>
    </condition>
