vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXC143_DFP.pdsc
    <condition id="driver.gt911.condition_id">
      <require condition="allOf.device=MCXC143.internal_condition"/>
    </condition>
    <condition id="driver.htu21d.condition_id">
      <require condition="allOf.anyOf=driver.i2c, driver.common, device=MCXC143.internal_condition"/>
    </condition>
    <condition id="driver.i2c.condition_id">
      <require condition="allOf.driver.common, device_id=MCXC143.internal_condition"/>
    </condition>
    <condition id="driver.i2c_dma.condition_id">
      <require condition="allOf.driver.dma, device=MCXC143.internal_condition"/>
    </condition>
    <condition id="driver.i2c_edma.condition_id">
      <require condition="allOf.driver.i2c, device=MCXC143.internal_condition"/>
    </condition>
    <condition id="allOf.driver.i2c, device=MCXC143.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c"/>
      <require condition="device.MCXC143.internal_condition"/>
    </condition>
    <condition id="driver.icm42688p.condition_id">
      <require condition="allOf.anyOf=driver.i2c, driver.common, device=MCXC143.internal_condition"/>
    </condition>
    <condition id="driver.ili9341.condition_id">
      <require condition="allOf.driver.common, device=MCXC143.internal_condition"/>
    </condition>
    <condition id="driver.llwu.condition_id">
      <require condition="allOf.driver.common, device_id=MCXC143.internal_condition"/>
    </condition>
    <condition id="driver.lptmr.condition_id">
      <require condition="allOf.driver.common, device_id=MCXC143.internal_condition"/>
    </condition>
    <condition id="driver.lpuart.condition_id">
      <require condition="allOf.driver.common, device_id=MCXC143.internal_condition"/>
    </condition>
    <condition id="driver.lpuart_dma.condition_id">
      <require condition="allOf.driver.dma, device=MCXC143.internal_condition"/>
    </condition>
    <condition id="driver.lsm6dso.condition_id">
      <require condition="allOf.anyOf=driver.i2c, driver.common, device=MCXC143.internal_condition"/>
    </condition>
    <condition id="driver.max30101.condition_id">
      <require condition="allOf.anyOf=driver.i2c, driver.common, device=MCXC143.internal_condition"/>
    </condition>
    <condition id="driver.mma8451q.condition_id">
      <require condition="allOf.anyOf=driver.i2c, driver.common, device=MCXC143.internal_condition"/>
    </condition>
    <condition id="driver.mma8652fc.condition_id">
      <require condition="allOf.anyOf=driver.i2c, driver.common, device=MCXC143.internal_condition"/>
    </condition>
    <condition id="driver.mx25r_flash.condition_id">
      <require condition="allOf.device=MCXC143.internal_condition"/>
    </condition>
    <condition id="driver.nmh1000.condition_id">
      <require condition="allOf.anyOf=driver.i2c, driver.common, device=MCXC143.internal_condition"/>
    </condition>
    <condition id="driver.p3t1755.condition_id">
      <require condition="allOf.anyOf=driver.i2c, driver.common, device=MCXC143.internal_condition"/>
    </condition>
    <condition id="driver.pcm186x.condition_id">
      <require condition="allOf.component.codec_adapters, component.codec_i2c, component.pcm186x_adapter, driver.codec, device=MCXC143.internal_condition"/>
    </condition>
    <condition id="allOf.component.codec_adapters, component.codec_i2c, component.pcm186x_adapter, driver.codec, device=MCXC143.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_adapters"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_i2c"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="pcm186x_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec"/>
      <require condition="device.MCXC143.internal_condition"/>
    </condition>
    <condition id="driver.pcm512x.condition_id">
      <require condition="allOf.component.codec_adapters, component.codec_i2c, component.pcm512x_adapter, driver.codec, device=MCXC143.internal_condition"/>
    </condition>
    <condition id="allOf.component.codec_adapters, component.codec_i2c, component.pcm512x_adapter, driver.codec, device=MCXC143.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_adapters"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_i2c"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="pcm512x_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec"/>
      <require condition="device.MCXC143.internal_condition"/>
    </condition>
    <condition id="driver.pf1550.condition_id">
      <require condition="allOf.anyOf=driver.i2c, driver.common, device=MCXC143.internal_condition"/>
    </condition>
    <condition id="driver.pf3000.condition_id">
      <require condition="allOf.anyOf=driver.i2c, driver.common, device=MCXC143.internal_condition"/>
    </condition>
    <condition id="driver.pf5020.condition_id">
      <require condition="allOf.anyOf=driver.i2c, driver.common, device=MCXC143.internal_condition"/>
    </condition>
    <condition id="driver.pit.condition_id">
      <require condition="allOf.driver.common, device_id=MCXC143.internal_condition"/>
    </condition>
    <condition id="driver.pmc.condition_id">
      <require condition="allOf.driver.common, device_id=MCXC143.internal_condition"/>
    </condition>
    <condition id="driver.port.condition_id">
      <require condition="allOf.driver.common, device_id=MCXC143.internal_condition"/>
    </condition>
    <condition id="driver.psp27801.condition_id">
      <require condition="allOf.driver.common, device=MCXC143.internal_condition"/>
    </condition>
    <condition id="driver.rcm.condition_id">
      <require condition="allOf.driver.common, device_id=MCXC143.internal_condition"/>
    </condition>
    <condition id="driver.rtc.condition_id">
      <require condition="allOf.driver.common, device_id=MCXC143.internal_condition"/>
    </condition>
    <condition id="driver.rtt.condition_id">
      <require condition="allOf.driver.rtt.template, device=MCXC143.internal_condition"/>
    </condition>
    <condition id="allOf.driver.rtt.template, device=MCXC143.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="rtt template"/>
      <require condition="device.MCXC143.internal_condition"/>
    </condition>
    <condition id="driver.rtt.template.condition_id">
      <require condition="allOf.device=MCXC143.internal_condition"/>
    </condition>
